[
    {
        "Nom du Club": "Jeunes Leaders Marocains (JLM)",
        "Lien": "http://ensak.usms.ac.ma/ensak/campus/jeunes-leaders-marocains/",
        "Résumé": "Principe\n« SPREADING HOPE, SPREADING JLM »\nJLM ENSA Khouribga de l’Ecole Nationale des Sciences Appliquées Khouribga fait partie du réseau JLM(Jeunes Leaders Marocains) qui est une initiative marocaine parrainée par le ministère du développement social, de la Famille et de la Solidarité à travers l’organisme de l’Entraide Nationale, crée au sein de l’ENSA Khouribga en 2013, représentée par les étudiants de l’ENSA, met en place un certain nombre de projets lucratifs destinés pour améliorer la qualité et le niveau de vie d’un grand nombre d’individus en situation précaire à travers l’enseignement des principes de la solidarité, l’économie de marché, l’entrepreneuriat social, la réussite financière et l’éthique dans le domaine des affaires, tout en visant d’encadrer et former des étudiants ingénieurs marocains dans la création et la gestion de projets générateurs de revenus au profit des populations dans le besoin.\nNotre club JLM a pour missions de:\nDévelopper l’esprit entrepreneurial chez les jeunes tout en participant au développement de leurs communautés et de leurs pays.\nInculquer et renforcer les principes de solidarité et d’entraide chez nos jeunes ingénieurs\nCompétition nationale JLM\nJLM MAROC organise une compétition nationale à la fin de chaque année universitaire. C’est une occasion aux équipes JLM pour présenter leurs projets devant un jury qui estime l’influence socio-économique des projets sur la communauté marocaine.\nL’équipe ayant les meilleurs projets sera déclarée gagnante. C’est l’équipe champion national JLM qui sera récompensée par la mission internationale ‘Ambassadeurs JLM’, une mission qui leurs assure une visite à un pays afin de partager le savoir et échanger l’expérience. Dans un environnement de challenge et de partage au titre de la compétition Nationale, notre équipe JLM ENSA Khouribga a remporté le titre de *Champion National JLM 2014* en se distinguant par des projets d’innovation en entrepreneuriat social et créateurs de richesse. Ce sont 7 projets permettant une meilleure appréhension des problématiques socio-économique.\nInnovTech :\nqui vise la création d’un ensemble de projets techniques à caractère social à l’image du projet,\nPerspective :\nà travers l’invention de 2 machines permettant aux personnes non-voyantes de retrouver ce sens ou encore le projet :\nHandiBike :\nvisant la création de tricycle adapté aux personnes à mobilité réduite pour l’exercice d’activités commerciale permettant leur réintégration socioéconomique.\nYouth Mentoring :\nqui a pour but d’encadrer et orienter les jeunes lycéens dans leurs choix de formation et de carrière, plus de 4202 jeunes de 9 villes du Royaume ont pu bénéficier d’un accompagnement personnalisé.\nGreen Hand :\nest un projet dans lequel les jeunes JLM ont encadré plus de 1.000 enfants pour promouvoir et mettre en place des actions concrètes visant la protection de l’environnement. Avec la créativité et la persévérance de notre équipe JLM, « they make dreams come true » et c’est ça notre but.\nEn 2022,\nnotre équipe JLM a participé à la compétition nationale des jeunes leaders marocains et on a réussi à raccrocher le prix de la championne d’environnement JLM 2022 à travers notre travail sur des projets et des actions qui touchent ce critère (environnemental).\nCellules de JLM :\nLa présence des cellules dans JLM, facilitent beaucoup plus la tâche du club dans la réalisation des actions, projets et évènements, ainsi qu’elles travaillent  sur l’apprentissage et le développement de plusieurs compétences (c\nô\nté communicationnel, c\nô\nté technique, c\nô\nté sponsoring, c\nô\nté logistique et transport)  que visent plusieurs étudiants à évoluer.\nD’où, la présence de ces 3 cellules :\nCellule de communication et audio-visuel.\nCellule de sponsoring.\nCellule logistique."
    },
    {
        "Nom du Club": "Théâtre et Cinéma",
        "Lien": "http://ensak.usms.ac.ma/ensak/campus/theatre-et-cinema/",
        "Résumé": "C’est quoi le CTC ?\nLe Club de théâtre et cinéma a été fondé le 10 septembre 2019. C’est une communauté qui vise à sortir le côté artistique caché au fond de chaque élève ingénieur de le sortir du cadre de la personne emprisonné entre les démonstrations et le faire briller dans le ciel d’art.\nQuel est son objectif ?\nNotre objectif majeur et de cultiver des ingénieurs artistes qui réunissent entre la culture artistique et les acquis scientifique.\nC’est la combinaison magique qui touche à la perfection, la pratique des différentes rubriques d’art permet la décontraction, la confiance en soi et surtout facilite la prise de parole et des décisions ce qui rend le domaine d’embauche flexible et accessible à ce genre d’ingénieurs sans oublier le travail collectif qui efforce l’esprit de leadership chez nos membres.\nEt il contribue également au développement de nouvelles initiatives au niveau social.\nPour plus d’information, merci de nous contacter sur les pages du club ou les membres de bureau :\nPages du Club\nSuivez-nous sur :\nThéâtre et du Cinéma\nÀ propos :\nSe mettre devant un public n’est pas toujours évident mais en pratiquant le théâtre tout sera flexible, donc l’objectif majeur de cette cellule est de renforcer la confiance en soi et le travail Collectif de plus, le cinéma fait dévoiler l’imagination et la créativité chez ses pratiquants à travers l’écriture des scénarios, la réalisation qui vous fait voir avec un œil artistique.\nNos plans :\n– Organisation des pièces théâtrales.\n– Participation aux activités culturelles au sein de l’école.\n– Participation aux festivals nationaux et internationaux de théâtre.\n– Organisation des formations et des masters classes mensuels.\n– Organisation des visites aux établissements artistiques.\n– Organisation des projets de cinéma topographique.\nCellule D’art\nÀ propos :\nLa cellule d’art comme étant une source de créativité elle est le cœur du club Théâtre cinéma car elle réunit dans ces ateliers (Photographie, filmographie, design, graphity et painting) les outils du succès de chaque projet artistique\nNos plans :\n– Apprendre photo/video Editing\n– Créé un espace artistique d’épanouissement pour les étudiants\n– former un esprit d’initiative chez les futurs ingénieurs\n– Renforcer l’esprit du défi chez les membres à travers les compétitions et les challenges\nEnsakh Radio\nÀ propos :\nLa radio ENSA Khouribga est une grande chance des étudiants pour faire entendre leurs voix, discuter leurs problèmes et aussi se bénéficier des expériences des anciens lauréats. C’est le réseau qui fait réunir la famille Ensakh à travers des différentes émissions et podcasts\nObjectifs généraux de la radio étudiante :\n– Joue le rôle de la presse au sein de l’ENSA Khouribga.\n– Une formation permettant d’accroître les capacités en matière de réalisation, de technique et d’animation d’une émission de radio.\n– Créer une animation à l’intérieur de l’école.\n– Développer l’autonomie, l’autodiscipline et l’esprit d’équipe.\n– Se familiariser avec des techniques de communication.\n– Augmenter la confiance personnelle.\nMembres du Club"
    },
    {
        "Nom du Club": "Enactus",
        "Lien": "http://ensak.usms.ac.ma/ensak/campus/enactus/",
        "Résumé": "Enactus ?\nEnactus est une ONG internationale qui œuvre dans le domaine de l’entrepreneuriat social estudiantin et le développement durable. Elle a été créée en 1975, et basée à Missouri – USA\nLa création de l’équipe, ENACTUS ENSA Khouribga, est venue pour répondre à l’appel de sa majesté le roi Mohammed 6 lancé en mai 2005 pour le développement humain au niveau national, par la création ou l’implantation des projets à but lucratif afin de venir en aide à des populations en situation difficile et améliorer leurs quotidiens, ainsi de préparer les étudiants à contribuer substantiellement au développement de leur pays en tant que futurs leaders entrepreneurs, éthiques et socialement responsables. La date de création d’Enactus Ensa Khouribga remonte à 2009.\nVision\nUn monde où les jeunes, les leaders du monde académique et économiques s’engagent dans l’action entrepreneuriale pour favoriser le progrès sociétal et façonner un monde meilleur et durable.\nMission\nAccompagner les étudiants dans la mise en œuvre de leurs projets d’entrepreneuriat social, à travers des événements, des formations et des concours nationaux et internationaux.\nMembres\nL’équipe est constituée des élèves ingénieurs de l’Ecole Nationale des Sciences Appliquées de Khouribga [ENSA] et bien soutenue par un staff de conseillers pédagogiques constitué des professeurs et jeunes dirigeant. Le conseiller pédagogique de notre équipe est\nPr. HAFIDI Imad\nConseil d’administration\nNos Projets\nAgrodome :\nUn projet qui met à la disposition des agriculteurs et marchants des légumes et fruits des tentes spéciales qui permettent de prolonger la durée de conservation de leurs produits agricoles. Agrodome résout le problème de pertes de récoltes en conservant l’humidité des fruits et légumes en créant un microclimat à l’intérieur de la tente.\nMedico-Call :\nUn service d’aide par téléphone qui offre un soutien psychologique à toute personne souffrant de problèmes psychologiques, de dépression ou même de solitude. La gestion du service se fait à travers une plateforme web qui permet au client de consulter son compte et payer pour activer son passe appel. Le projet offre également des opportunités d’emploi pour des spécialistes du métier qui sont en chômage. Ces derniers constituent un organe essentiel dans le développement du projet. Des réunions s’effectuent de manière régulière avec ses spécialistes pour recruter d’autres profils.\nBistic :\nUn projet qui produit et commercialise des ustensiles mangeables biodégradables à base des produits naturels que vous pouvez manger avec, puis les manger par la suite. Résistants à tout type de plat : chaud froid liquide et même solide, et qui peuvent même être consommées comme des compléments alimentaires suite à la valeur nutritive des ingrédients.\nTrip’on :\nUn projet qui vise à promouvoir l’activité économique des régions avec un grand potentiel touristique, et ce en organisant des voyages personnalisés et originaux.\nBanana fiber :\nLe projet consiste d’extraire les fibres de banane à partir des pétioles (base de feuilles du bananier) ou les déchets de banane pour la fabrication des sacs et sachets. La fibre de banane est aussi utilisée pour la fabrication des textiles\nDatty :\nDatty est un projet qui consiste à produire et à commercialiser une alternative au café à base des noyaux des dattes torréfiés et moulus.\nNos départements\nDépartement Recherche et Développement :\nC’est parmi les départements les plus importants au sein de l’équipe. Les membres de ce département travaillent sur le Need Assessement, les visites sur terrain, l’analyse des problématiques et la recherche des projets. La mission essentielle du département réside dans l’élaboration d’une étude de faisabilité de nouvelles idées de projet. C’est un véritable environnement d’apprentissage et de développement de soi.\nDépartement Finance et Sponsoring :\nL’équipe sera responsable de l’analyse et la prévoyance des différentes dépenses de l’équipe. Il établit avec son équipe un plan financier pour la rentabilisation de l’équipe. Il veille également sur la recherche et la négociation avec des sponsors potentiels.\nDépartement communication technique et marketing :\nL’équipe sera chargée de la réalisation, design et impression des affiches, flyers, et tout autre support de publicité pour l’équipe. Elle travaille aussi sur l’élaboration des plans de marketing de l’équipe, en plus des concepts innovants de communication."
    },
    {
        "Nom du Club": "Comité MASJID",
        "Lien": "http://ensak.usms.ac.ma/ensak/campus/comite-masjid/",
        "Résumé": "C’est quoi Comité MASJID ?\nLe Comité Masjid a été fondé le 30 septembre 2019. C’est une communauté d’étudiants s’engagent à créer une ambiance conviviale entre les élèves ingénieurs pour renforcer leur sentiment d’appartenance, et adhérer davantage à des valeurs et des principes éthiques.\nLe Comité Masjid est un environnement de partage d’idées et d’expériences pour bien construire non seulement le côté professionnel et personnel de l’élève ingénieur mais aussi le côté spirituel.\nQuel est son objectif ?\nLe Comité Masjid agit dans le domaine de l’action éducative, culturelle et sociale.\nIl vise à favoriser le développement personnel des élèves ingénieurs au sein de l’école à travers les formations, les projets et les événements organisés par le club.\nEt il contribue également au développement de nouvelles initiatives au niveau social.\nLe comité est aussi responsable de tout ce qui concerne la salle de prière du point de vue entretien , nettoyage, suivi et maintenance.\nLe Comité Masjid réalise ses objectifs à travers plusieurs activités , entre autres : des formations de soutien, des compétitions et des actions sociales.\nPour plus d’information, merci de nous contacter sur les pages du club ou les membres de bureau :\nPages du Club\nSuivez-nous sur :\nMembres du Club"
    },
    {
        "Nom du Club": "Codex",
        "Lien": "",
        "Résumé": "Créé en 2024, Codex est un club académique relevant du département de Mathématiques et Informatique, fondé dans le but d’offrir un espace dédié spécifiquement aux étudiants de ce département. Il se distingue par sa spécialisation dans les domaines du développement informatique, de l’analyse des données et de l’intelligence artificielle. Le club vise à favoriser l’apprentissage et la pratique à travers des projets concrets, des ateliers techniques, ainsi que des formations autour des technologies les plus innovantes du moment.\n\nCodex a également pour objectif de préparer les étudiants aux défis du monde professionnel en renforçant leurs compétences techniques, en promouvant la collaboration interdisciplinaire, et en les initiant à la gestion de projet. En plus de son activité pédagogique, Codex joue un rôle stratégique dans la vie étudiante du département en assurant la coordination et l'organisation de nombreux événements : conférences, compétitions, hackathons, et forums technologiques. Il constitue aujourd’hui un véritable moteur de dynamisme au sein du département Mathématiques et Informatique, alliant expertise technique, esprit d’équipe, et engagement associatif."
    },
    {
        "Nom du Club": "OpenMind",
        "Lien": "",
        "Résumé": "OpenMind est un club de robotique appartenant au département de Génie Électrique. Il s’inscrit dans une dynamique de développement technologique et d’innovation en robotique. Le club a pour principale mission de former les étudiants aux concepts fondamentaux et avancés de la robotique, à travers des ateliers pratiques, des formations techniques, et l'encadrement de projets multidisciplinaires.\n\nDepuis sa création, OpenMind œuvre à la mise en œuvre de projets concrets et stimulants dans les domaines de la mécatronique, de l’électronique embarquée, de l’automatisation et de l’intelligence artificielle appliquée à la robotique. Les membres du club, organisés en équipes projets, développent des robots et prototypes fonctionnels qu’ils présentent lors de compétitions à la fois internes à l’école et externes au niveau national.\n\nOpenMind représente ainsi un espace d’apprentissage, d’expérimentation et de dépassement de soi, où les étudiants passionnés de robotique peuvent évoluer dans un environnement collaboratif, créatif et compétitif. Il joue un rôle important dans le rayonnement du département de Génie Électrique grâce à la qualité de ses projets, la performance de ses équipes en compétition, et la transmission du savoir technique à la communauté étudiante."
    }
]