[
    {
        "event_name": "DataVerse",
        "description": "DataVerse est un événement annuel majeur organisé par la filière Informatique et Ingénierie des Données de l’École Nationale des Sciences Appliquées de Khouribga, en partenariat avec le département de mathématiques et informatique. Il a pour mission de rassembler la communauté académique et professionnelle autour des enjeux actuels et futurs de la science des données, de l’intelligence artificielle, du DevOps, de la cybersécurité, et de la digitalisation. \n\nL'événement s’étend sur deux journées riches en contenu et en interactions, offrant un espace privilégié de réflexion, d’échange et de partage entre étudiants, enseignants-chercheurs, professionnels, entreprises et passionnés du domaine. Le programme est soigneusement élaboré afin de couvrir une large variété de thématiques liées à la data science et à ses applications dans le monde réel. \n\nParmi les temps forts figurent : \n- Des conférences animées par des experts reconnus du secteur, portant sur des sujets techniques, scientifiques et stratégiques. \n- Des tables rondes interactives permettant de débattre des défis et des opportunités liés à la transformation numérique et à l’exploitation intelligente des données.\n- Des ateliers de coaching pour le développement personnel, la préparation de CV et les entretiens, ainsi que des sessions de partage d’expérience animées par les lauréats de la filière.\n- Des activités de divertissement et de team-building visant à renforcer les liens entre les participants dans une ambiance conviviale et dynamique. \n- Une compétition technique où des équipes d'étudiants travaillent sur des problématiques réelles, proposées par des entreprises ou des professeurs, afin d’élaborer des solutions data-driven. Cette compétition représente une opportunité concrète de valoriser leurs compétences analytiques, de mettre en pratique leurs connaissances, et de se distinguer auprès de recruteurs potentiels.\n-Un forum d’entreprise est organisé afin d’offrir aux étudiants l’opportunité de découvrir les activités et la stratégie de digitalisation des entreprises partenaires, tout en facilitant la recherche de stages PFA (projets de fin d'année) et PFE (projets de fin d'études) à travers des échanges directs et un processus de recrutement ciblé.\n\nL’un des objectifs clés de DataVerse est de faciliter l’intégration des étudiants dans le monde professionnel à travers : \n- Des rencontres directes avec des recruteurs. \n- L’identification d’opportunités de collaboration et de développement professionnel. \n- Le renforcement des liens entre l’enseignement supérieur et l’industrie numérique. \n\nL'événement encourage également les jeunes porteurs de projets à explorer les applications concrètes de la data science, à échanger des idées innovantes, et à comprendre les compétences techniques et analytiques requises dans un monde de plus en plus piloté par les données.\n\nDataVerse contribue ainsi à l’émergence d’une nouvelle génération de talents dans les domaines du numérique, à travers une dynamique de formation, de compétition, de réseautage et d’ouverture sur les évolutions technologiques du moment."
    },
    {
        "event_name": "ELECTRODAYS",
        "description": "ELECTRODAYS est un événement annuel majeur organisé par les étudiants ingénieurs du département de Génie Électrique de l’École Nationale des Sciences Appliquées de Khouribga. Depuis sa première édition, ELECTRODAYS s’est imposé comme un rendez-vous incontournable pour les professionnels, étudiants, chercheurs et entreprises œuvrant dans les secteurs liés au génie électrique et aux technologies industrielles. \n\nL'événement se distingue par sa contribution active à l'évolution industrielle, en offrant une plateforme de réflexion, d’innovation et de partage autour des dernières avancées scientifiques et technologiques. Il a pour mission de favoriser l’intégration des lauréats de la filière dans le monde professionnel tout en consolidant les liens entre le milieu académique et le monde industriel.\n\nLes activités proposées lors d’ELECTRODAYS sont diversifiées et riches :\n- Des **conférences techniques et scientifiques** animées par des experts reconnus dans les domaines de l’électronique, de l’énergie, de l’automatisation, de l’intelligence artificielle appliquée au secteur industriel, etc.\n- Des **tables rondes** réunissant des professionnels, des chercheurs et des étudiants pour discuter des enjeux actuels et futurs de l’ingénierie électrique et de la digitalisation industrielle.\n- Un **forum d’entreprise** où les entreprises exposent leurs projets, technologies et opportunités de stages, PFE ou d’emploi, permettant aux participants de tisser des liens professionnels durables.\n- Des **compétitions techniques**, notamment une **compétition de robotique**, visant à mettre en valeur les compétences pratiques et l’esprit d’innovation des étudiants.\n- Des **activités de divertissement et de cohésion** (quiz, jeux techniques, animations), favorisant un environnement convivial et dynamique.\n\nELECTRODAYS représente une véritable passerelle entre le monde académique et industriel, un carrefour d’opportunités pour le développement professionnel, l’échange scientifique et la découverte des innovations qui façonnent le futur du génie électrique."
    },
    {
        "event_name": "Open Source Days",
        "description": "Open Source Days est un événement emblématique organisé chaque année par les étudiants de la filière Génie Informatique de l’École Nationale des Sciences Appliquées de Khouribga. Fort d’une longue tradition et reconnu comme l’un des événements techniques les plus anciens de l’école, Open Source Days est une célébration de l’innovation, de la collaboration et de l’excellence dans les domaines du développement logiciel, du DevOps, et des technologies open source.\n\nConçu pour répondre aux attentes des passionnés du développement et des professionnels du numérique, l'événement met en avant les dernières tendances du secteur à travers un programme riche et intensif. Il constitue un carrefour d’échanges entre étudiants, développeurs, architectes logiciels, ingénieurs système, chercheurs, entreprises technologiques et membres actifs des communautés open source.\n\nLes moments forts de l’événement comprennent :\n- Des **conférences techniques approfondies** animées par des spécialistes du développement logiciel, du cloud computing, de l’ingénierie des systèmes, du DevOps, de l’architecture logicielle moderne, de l’automatisation, et des technologies open source.\n- Des **tables rondes** réunissant des experts du domaine pour débattre des défis du développement applicatif moderne, de la culture DevOps, de la sécurité logicielle, et de l’évolution de l’écosystème open source.\n- Un **forum d’entreprise** où les entreprises partenaires présentent leurs innovations, projets open source, offres de stage, PFA, PFE, ou emploi, facilitant ainsi les échanges professionnels et le réseautage.\n- Des **ateliers pratiques et hands-on labs** permettant aux participants de mettre en application leurs compétences en développement web, CI/CD, conteneurisation, infrastructure as code, etc.\n- Un hackathon où les étudiants résolvent un problème à l’aide d’algorithmes et d’autres techniques, visant à stimuler leur esprit d’équipe, leur créativité et leur maîtrise des technologies.\n- Des **activités de divertissement et de cohésion**, créant un environnement stimulant, détendu et propice aux interactions humaines.\n\nL’événement propose également :\n- Des **sessions de coaching** axées sur la rédaction de CV techniques, la préparation aux entretiens d’embauche dans le secteur informatique, et le développement personnel.\n- Des **retours d’expérience inspirants de lauréats** de la filière Génie Informatique, partageant leur parcours professionnel, leurs réalisations et leurs conseils aux nouvelles générations.\n\nOpen Source Days vise à promouvoir l’esprit open source, la culture DevOps et les bonnes pratiques du développement logiciel dans un monde où la collaboration et l’agilité sont devenues des piliers de la réussite technologique. Il joue un rôle clé dans la préparation des étudiants aux exigences du marché, en favorisant l’apprentissage actif, l’expérimentation, et la connexion avec le monde professionnel. À travers cet événement, la filière Génie Informatique continue d’insuffler une dynamique d’innovation continue, de transmission du savoir et de contribution à la communauté technologique."
    },
    {
        "event_name": "Netcom Days",
        "description": "Netcom Days est un événement annuel de référence organisé par les étudiants du département Réseaux, Télécommunications et Cybersécurité de l’École Nationale des Sciences Appliquées de Khouribga. Véritable rendez-vous pour les passionnés de sécurité informatique, les professionnels du numérique et les futurs ingénieurs en cybersécurité, l'événement est devenu incontournable au fil de ses six éditions, combinant technicité, immersion, et partage communautaire.\n\nLa 6e édition de Netcom Days s’est tenue sous le thème : \"Red Team vs Blue Team in the Age of IoT\", mettant en avant les problématiques actuelles et stratégiques de la cybersécurité dans un monde dominé par les objets connectés. À travers ce thème, l'événement aborde les approches offensives et défensives en matière de sécurité dans l’ère de l’Internet des objets.\n\nDurant deux jours, les participants vivent une expérience intense et complète grâce à un programme riche et ciblé comprenant :\n- Des **workshops techniques** encadrés par des professionnels reconnus du domaine, permettant aux étudiants de se former aux outils et techniques de cybersécurité les plus actuels.\n- Des **compétitions de type Capture The Flag (CTF)** ouvertes à tous les passionnés de hacking éthique et de cybersécurité offensive.\n- Des **tables rondes et débats interactifs** avec des experts nationaux et internationaux, abordant les enjeux contemporains de la cyberdéfense, de l’IoT, de la cyber-résilience et de la gouvernance de la sécurité.\n- Un **espace de networking** favorisant les échanges entre étudiants, enseignants, chercheurs, professionnels et recruteurs du secteur.\n\nAu-delà des activités, Netcom Days constitue une **véritable plateforme d’apprentissage, de sensibilisation et de valorisation des compétences** marocaines en cybersécurité. L'événement a pour vocation de :\n- Créer une **communauté active, engagée et solidaire** autour des enjeux de la cybersécurité.\n- Renforcer les liens entre **l’industrie, le monde académique et les talents émergents**.\n- Mettre en lumière **les opportunités professionnelles**, les innovations et les défis du secteur.\n\nNetcom Days attire chaque année l’attention d’un public ciblé, composé d’étudiants, d’enseignants, d’experts, d’ingénieurs, d’entreprises spécialisées et d’institutions nationales. En soutenant cet événement, les partenaires contribuent directement à la **formation de la prochaine génération d’experts en cybersécurité**, tout en renforçant leur visibilité et leur positionnement dans un écosystème numérique en pleine croissance.\n\nNetcom Days s’inscrit ainsi comme un pilier stratégique pour la **promotion de la cybersécurité au Maroc**, en combinant excellence académique, professionnalisation, compétitivité et esprit communautaire."
    },
    {
        "event_name": "JENR",
        "description": "Les Journées des Énergies Renouvelables (JENR) constituent un événement phare organisé par les étudiants de la filière Génie des Procédés, de l’Énergie et de l’Environnement (GPEE) de l’École Nationale des Sciences Appliquées de Khouribga. Dédié aux enjeux actuels et futurs liés à l’énergie, aux procédés industriels durables et à la transition écologique, JENR rassemble une communauté multidisciplinaire d’étudiants, de chercheurs, d’ingénieurs, d’experts et d’acteurs institutionnels et industriels.\n\nCet événement s’inscrit dans une volonté forte de sensibiliser et de former les futurs ingénieurs aux défis énergétiques mondiaux, tout en valorisant les innovations en matière de génie des procédés, d’énergies renouvelables, et de technologies de conversion énergétique.\n\nDurant deux journées riches et variées, le programme de JENR propose :\n- Des **conférences scientifiques** animées par des experts du domaine, traitant de sujets d’actualité comme la transition énergétique, l’efficacité industrielle, la décarbonation, et la valorisation des déchets.\n- Des **workshops pratiques et techniques**, axés sur des thèmes concrets tels que l’hydrogène vert, la production d’énergie solaire et éolienne, les procédés de traitement de l’eau, ou encore l’optimisation énergétique dans les systèmes industriels.\n- Un **forum d’échange** entre étudiants et professionnels, permettant aux participants de discuter de leurs projets, d’explorer les opportunités de stages et de réseauter avec des entreprises du secteur.\n- Une **compétition technique** où des équipes d'étudiants proposent des solutions innovantes autour de problématiques environnementales et énergétiques, encourageant la créativité, la collaboration et l'esprit d’initiative.\n- Des **pauses de divertissement et d’activités ludiques**, visant à renforcer la cohésion entre les participants dans une ambiance conviviale.\n\nJENR se distingue par son approche transversale, mêlant science, technologie, environnement et développement durable. L’événement vise à :\n- Promouvoir une **culture énergétique responsable et innovante**.\n- Créer un **pont entre l’enseignement supérieur et les secteurs industriels** de l’énergie et de l’environnement.\n- Stimuler chez les étudiants une **prise de conscience des enjeux écologiques** et une volonté d’agir en tant qu’acteurs du changement.\n\nEn participant ou en soutenant JENR, les partenaires contribuent activement à la **formation d’une génération d’ingénieurs engagés**, dotés de compétences techniques solides, d’un sens critique, et d’un esprit de responsabilité face aux défis climatiques et énergétiques.\n\nJENR est ainsi un catalyseur d’idées, de projets et de solutions durables au service de l’avenir énergétique du Maroc et du monde."
    }
]